[
  {
    "text": "저는 보드게임을 정말 좋아해요. 근데 코로나 시대를 맞이하게 되면서 5명 이상 못 만나다 보니까 보드게임을 할 수 있는 기회가 많이 줄어들었어요. 그래서 직접 만나지는 못하더라도 친구들과 같이 보드게임을 하고 싶어서 프로젝트를 시작하게 됐어요."
  },
  {
    "text": "이 프로젝트는 ‘한밤의 늑대인간’이라는 보드게임을 디스코드 봇으로 구동할 수 있게 만드는 것을 목표로 하고 있어요. 처음에는 혼자 시작했어요. 한 달에 걸쳐 만들고 친구들과 실제로 플레이 하기도 했었죠. 당시에는 몰랐는데 나중에 보니까 이리저리 꼬인 스파게티코드이기도 하고 버그도 많더라고요. 누구한테 보여주기도 민망한 코드라서, 제대로 뜯어고쳐 보고 싶다는 생각이 들었죠. 주위 카뎃분들에게 게임 만들고 있다고 말했더니 생각보다 많은 분들이 관심을 가져주셨어요. 그중 도움 주신다는 분을 포함해서 4명의 카뎃분들과 함께 ‘고요한 고요일’이라는 이름으로 시작하게 됐어요."
  },
  {
    "text": "프로젝트는 Go라는 언어를 사용해서 만들고 있죠. Go는 국내에서는 많이 사용하지 않지만, 2009년 구글에서 개발했고 다른 언어들보다 속도가 빠른 게 특징이에요. 컴파일 속도를 빠르게 하기 위해서 여러 가지 기법을 사용해 불필요한 과정들을 없앴고 병렬처리가 굉장히 쉬운 언어에요. ‘채널’과 ‘고루틴’이라는 요소가 있는데 이걸 이용하면 여러 작업을 동시 진행하는 부분에 있어서 굉장히 유리해요. 그리고 네트워크나 클라우드와 관련된 곳에서 Go를 주로 사용한다고 들었어요. 사용하는 상황에 적절한 이유가 있어야 하는 언어라고 들어서, 프로젝트를 진행하면서 Go를 사용하고 있는 멘토님들을 찾아 조언을 받고 있어요. 고요일 멤버들과 함께 ZeroOneAI 송준호 멘토님, 컴투스 최흥배 멘토님 두 분께 멘토링을 받았고, 그 덕에 이전에 짰던 코드와는 전혀 다른 모습이 될 수 있었어요. 멘토링을 통해서 프로젝트 방향 설정과 더불어 클라우드 네이티브와 Go의 관계, 그리고 Go를 쓰는 이유와 앞으로 Go를 배울 때 중요한 점들이 무엇인지 배울 수 있어 좋았죠. 아직 게임이 완전하게 돌아가진 않지만, 멘토링을 받으면서 실제로 많은 부분이 보완됐어요."
  },
  {
    "text": "고등학생 무렵에는 수의대에 가고 싶었어요. 아버지가 귀농을 결심하시고 소를 키우게 돼서 제가 힘이 되고 싶었거든요. 고등학교 1학년 때까지는 성적이 잘 나왔는데 2학년이 되면서 건강이 좋지 않아 병원에 다녀야 했어요. 한동안 쉬는 시간이 필요했고. 공부에만 집중하기는 어려웠죠. 3학년 1학기 즈음이 되고 나서야 그나마 건강이 많이 호전돼서 부랴부랴 공부를 시작했지만, 수의대를 갈 수 있을 만한 성적은 아니었어요. 그 와중에 초등학교 5학년 때쯤, 친구들이랑 하이퍼링크를 이용한 간단한 마우스 피하기 게임을 만들었던 기억이 떠올라서 프로그래밍에 대한 관심을 살리기 위해 정보공학과에 진학하게 됐죠. 이제는 프로그래밍을 좀 더 공부해서 아버지에게 직접적인 도움을 드리고 싶어요. 소는 가임기가 되면 활동량이 증가해서 평소에 안 하던 행동들을 시작하는데 그런 모습들을 놓치지 않고 적절한 시기에 수정시키는 게 중요해요. 그 시기를 놓치면 송아지 한 마리를 잃는 것과 마찬가지거든요. 기회가 되면 영상처리를 통해 이상행동 하는 소를 빨리 체크하고 알려주는 프로그램을 만들어보면 좋을 거 같아요."
  },
  {
    "text": "학교 수업 중에 ‘분산컴퓨팅’이라는 과목을 통해서 클라우드 플랫폼을 활용하는 방법들을 배웠던 게 인상적이었어요. 예전엔 컴퓨터 자원이 애니악같은 하나의 큰 센터 위주로 집중된 상황에서 PC의 보급확산으로 개인 사용자한테 분산처리되는 시스템으로 바뀌었다가 클라우드를 통해서 다시 중앙으로 집중되는 시점이라고 말하는 부분이 흥미로워서 클라우드 컴퓨팅에 관심이 생겼죠. 지금 Go를 공부하고 있는 이유이기도 하고요. 그런데 4학년 때 다시 공백기를 가져야했어요. 건강이 안 좋다 보니까 취업을 위해서 온 집중을 다 해도 모자란 데 누워있어야 하니까 답답했죠. 다 낫고 나서 뭔가 해보려 했지만 이미 공채 기간은 끝나있어서 현타가 오는 시기가 있었는데 그 시기에 42를 알게 됐어요. 사람들과 같이 공부하고 싶었는데 마침 잘 됐다 싶었죠."
  },
  {
    "text": "코로나로 인해서 작년 한 해 동안 학교 강의를 비대면으로 수강하게 됐는데, 건강 문제가 있기도 했고 학습 분위기에 영향을 많이 받는 편이라 집에서 혼자 공부하기가 정말 쉽지 않았죠. 그런데 42에서는 같은 진로를 꿈꾸는 사람들을 많이 만날 수 있어서 동기부여도 되고 멘토링도 받을 수 있다는 점이 좋아요. 그리고 대학교에서는 무임승차 문제 같은 난감한 상황이 많이 있었는데 42는 라피신이라는 힘든 과정을 통과한 열정 있는 사람들이 모인 곳이라 프로젝트 할 때 훨씬 더 좋은 것 같아요. 예를 들면, 라피신 과정에서 클러스터로 출석하지 않는 날에 강남역 12번 출구 앞에 있는 PC방에서 피시너분들이 모여 밤새 스터디했던 게 가장 기억에 남아요. 저희끼리 12클러스터라고 부르기도 했죠(웃음). 그렇게 열심히 해서인지 다행히 12클러스터에서 같이 공부한 피시너분들은 모두 피신을 통과하셨어요. 저는 42를 통해 같이 공부할 수 있는 동료들을 만날 수 있다는 것이 가장 좋은 것 같아요. 만약 42에 오지 않았다면 이런 경험도 못 했을 것이고 무기력하게 혼자서 많은 시간을 허비했을 것 같아요. 앞으로도 42에서 만난 사람들과 함께 ‘한밤의 늑대인간’을 실제로 사용할 수 있는 어플리케이션으로 만들어 배포까지 꼭 성공했으면 좋겠습니다."
  }
]
