[
  {
    "text": "42를 처음 알게 되었을 때 첫인상은 '아, 이거다! ' 였어요. 기존 교육기관의 방식은 고정된 커리큘럼을 따라가는 식이어서 마음에 안 들었지만, 42는 달랐거든요. 나의 속도에 맞춰서 커리큘럼을 진행할 수 있고, 활성화된 커뮤니티도 존재하는 곳이었기 때문에 이곳은 나를 위한 곳이라고 생각했죠. 그리고 '프랑스어도 모르고, 코딩도 모르는데 지원해도 될까요?' 란 질문에 42가 '바로 그런 사람을 우리가 원하는 겁니다' 라고 답했다고 전해 들어서, 여기가 더 매력적이라고 느꼈어요."
  },
  {
    "text": "블랙홀에 관해 얘기하자면, 예전에는 블랙홀이라는 제도가 아예 없었어요. 누구든지 본인의 속도에 맞춰서 학습을 진행할 수 있었죠. 그런데 학생 비자를 받기 위해 42에 등록만 하고 실제로는 학습을 진행하지 않는 사람들이 생겨나면서, 이들을 제외하자는 의도로 블랙홀을 만들었다고 하더라고요. 학습이 느린 사람을 제외하는 의도가 아니기 때문에, 이너 서클을 돌파하면 블랙홀은 사라지는 것을 알 수 있죠. 그때부터는 영원한 42인이 되는 거고요(웃음). 아 물론 현재 과정은 다를 수도 있어요! 현재는 예전보다 블랙홀도 빡빡하고 과제들도 새로운 거로 대체돼서 어떨지는 잘 모르겠네요."
  },
  {
    "text": "42서울은 프랑스에 있을 때 이민석 학장님의 연락을 통해 알게 되었어요. 42를 서울에 만들 예정인데, 인턴으로 들어오라는 제안이었어요. 제가 42를 너무 좋아하기도 했고, 42서울이 생겼으면 좋겠다고 생각하고 있어서 jai와 함께 지원하게 되었죠. 사실 인턴 제의가 들어오기 전에도, 한국에서 몇몇 분들이 파리 캠퍼스를 찾아오셨어요. 그때 저희를 인터뷰하시면서 42서울이 생기면 어떨지 여쭤보셨는데, 대다수의 의견은 부정적이었답니다. 나이에 따른 서열 등 한국적인 문화 때문에 42가 성공하기 어렵다고 생각했거든요. 하지만! 그때 저는 긍정적인 의견을 표출하면서 42서울 유치에 조금이나마 기여를 했답니다(웃음)."
  },
  {
    "imageDescription": "doby"
  },
  {
    "text": "42서울에 있으면서 여러 행사에 참여했었는데, 그 이유는 공동체 의식 때문이에요. 파리 캠퍼스에서도 크리스마스 같은 특별한 날에는 이벤트를 많이 하거든요! 그런 이벤트를 통해 즐거운 순간들이 많이 쌓이다 보면, 카뎃 분들이 커뮤니티에 애정을 가지게 되고 그럼 나중에 과정을 마친 카뎃 분들이 돌아와 커뮤니티에 기여를 하는 선순환이 생길 것이라 기대했어요. 그래서 모두가 함께 즐거운 시간을 보낼 수 있는 이벤트들을 많이 기획하고 참여했답니다."
  },
  {
    "text": "1기 1차 피신이 끝났을 때, 피신 슬랙에 긴 글을 남긴 적이 있어요. 그 글은 피신 Final Exam 도중에 쓰게 된 글인데요. 왜 쓰게 되었냐면… 피신은 제 인생에서 잊을 수 없는 기억이에요. 42서울의 피시너 분들에게도 잊을 수 없는 기억일 거구요. 그리고 해외 캠퍼스와는 다르게 42서울은 피신을 재도전할 수 없으니까 누군가와는 작별해야 하는데 그런 아쉬움도 있고, 저를 많이 좋아해 주신 분들에 대한 고마움도 있고… 아무튼 제가 피신 때 느꼈던 감정을 느끼고 있을 피시너 분들에게 '여러분은 대단한 사람들이에요’란 메시지를 전해주고 싶었어요. 여러 복합적인 감정들이 느껴져서 그 글을 쓰게 되었네요(웃음)."
  },
  {
    "text": "인턴을 하면서 기억나는 순간들이 정말 많지만, 2020년 2월 피신을 한번 말씀드리고 싶어요. 맨 처음 피신은 처음이자 마지막으로 마스크 없이 자유롭게 평가하던 시기였고 또 모든 사람이 클러스터에서 밤새우면서 고생하던 시기였고… 기억나는 것을 몇 가지 얘기해보자면, 피신 슬랙에 other_twitter란 채널이 있었어요. 그 채널을 처음 염탐할 때 딱 1분 계셨는데, 나중에 보니까 트위터 감성이 가득한 글들을 쭉 올리시더라고요! 알고 보니 피신은 보안 때문에 정보를 유출할 수 없으니 대신 그 채널에 글을 올리시는 거였어요(웃음). 시간이 지나니까 그 채널이 유명해져서, 마지막 날 하루 전에는 팬 미팅을 가지기도 했답니다!"
  },
  {
    "text": "피신을 시작하시는 분들에게 말씀을 드리자면 우선 42라는 커뮤니티가 기존의 학교 같은 공간과는 매우 달라요. 스스로 개척해나가야 하고, 주변인들과 계속 소통해야 하고, 그러면서도 유머러스한 면을 요구하기도 하고. '저렇게까지 통통 튀면 튀어 나가지 않을까?' 하는 사람도 있고 말이죠. 한국 내의 작은 외국이라고 생각하고, 어떤 일이라도 일어날 수 있다는 오픈 마인드를 가지고 들어오면 더 즐길 수 있을 거예요."
  }
]
