[
  {
    "text": "42서울에 오기 전에는 오버워치 프로게이머 생활을 했어요. 2016년 5월에 출시된 게임인데 6월~7월 즈음에 프로게이머가 되었죠. 원래는 프로게이머가 되려면 좀 더 복잡한 과정을 통하지만, 당시는 거의 첫 리그라서 랭크 점수가 높았던 사람들을 뽑아서 팀을 만들었어요."
  },
  {
    "text": "그때는 게임에 미쳐 pc방에서 6시간 정도 연습 경기를 진행하며 피드백을 받았어요. 그 과정을 스크림이라고 부르는데, 정말 잘하는 사람들이랑 하니까 정신적 스트레스가 엄청 심했어요. 그 후에는 게임을 새벽까지 하니까 육체적 스트레스도 심했죠. 내가 좋아하는 게 일이 되니까 더 못 즐기겠더라고요. 예전에는 단순히 게임을 좋아해 실수해도 웃어넘길 수 있었는데, 일이 되니까 더는 즐길 수 없게 되고 말도 거칠어지게 되더라고요."
  },
  {
    "text": "프로게이머 생활을 절대 후회하지 않아요. 적을지라도 좋아하는 게임을 하면서 돈을 받을 수 있다는 장점 때문이죠. 또, 대회에서 팬분들의 응원과 함께 팀원들과 열심히 소통하며 게임을 이겼을 땐 온몸에서 피가 싹 빠지는 짜릿함이 있거든요. 그런 느낌 때문에 내가 좋아하는 일을 하면서 돈을 벌고 싶다고 생각했어요."
  },
  {
    "text": "그러다가 그만둔 계기는 프로게이머가 엄청 수동적인 직업이라고 느껴져서에요. 아무리 게임을 열심히 해도, 패치 한 번에 큰 영향을 받아요. 특히 저는 한 챔피언에 특화된 유저라서 패치 후 그 챔피언의 능력치가 약해지면 성과를 내기 더 힘들었죠. 그리고 게임 자체의 인기도 중요해요. 처음 프로게이머를 시작했던 2016년에는 오버워치가 인기가 있었어요. pc방 점유율로 리그 오브 레전드라는 게임을 이긴 적도 있었죠. 그러다가 인기가 점점 식으면서 시장 자체가 엄청 작아졌어요. 아무튼 노력과는 상관없이 패치나 인기 같은 외부 요인에 따라 영향을 받는다는 점이 수동적으로 느껴져서 리그 휴식기에 프로게이머를 그만뒀어요."
  },
  {
    "text": "프로게이머를 그만둔 후 군대에 갔어요. 2년이라는 긴 시간 동안 군대에서 내가 좋아하는 것을 찾으면 되겠다고 생각했죠. 책을 많이 읽으면서 책 자체가 좋아졌고, 사서란 직업을 찾아보기도 했어요. 그러다가 병장 때 코딩이 유행이라는 말을 들어서, 싸지방(사이버 지식 정보방; 부대에 설치된 컴퓨터 이용 시설)에서 파이썬 코딩을 하니까 재밌더라고요. 그래서 ‘조금 더 공부해보자!’라는 생각이 들었어요."
  },
  {
    "imageDescription": "sub1"
  },
  {
    "text": "코딩을 가르쳐주는 다른 곳들도 많지만, 42서울을 선택한 이유는 기초를 배우고 싶어서에요. 다른 곳에서 코딩을 시작하려고 하면 프론트엔드 과정같이 바로 써먹을 수 있는 걸 가르쳐주더라고요. 일례로 코딩 학원을 반년 정도 다녔고, 거기에서 파이썬 + Django를 배웠는데, 사용법만 알려주고 메모리나 운영체제 같은 기초 지식은 알려주지 않더라고요. 전 그런 것들을 배우고 싶은데 학교를 다시 돌아가기는 싫어서 나에게 기초를 알려줄 수 있는 42서울에 오게 되었어요."
  },
  {
    "text": "꾸준히 문제를 제기해줄 수 있는 사람들과 함께 프로젝트를 진행하고 싶어요. 무언가 이상하게 흘러가고 있다면, 다수의 눈치를 보지 않고 본인의 의견을 얘기해줄 수 있는 사람들이죠. 남들이 모두 YES라고 말할 때 나 혼자 NO라고 말해주는 사람이 있어야 더 많은 의견이 나오고 좋은 방향으로 흘러갈 수 있으니까요."
  },
  {
    "text": "코딩은 혼자 하는 일이라고 생각할 수도 있지만, 코딩의 진정한 재미는 다른 사람들과 프로젝트를 하면서 나온다고 생각해요. 과제를 해결하면서 혹은 평가를 하면서 소통을 하기도 하지만, 프로젝트를 하면서 훨씬 더 많은 소통을 하게 됩니다. 예를 들어 프론트엔드와 백엔드가 API 문서를 작성할 때도, API 문서를 잘못 짜서 사과할 때도 되게 재밌거든요. 사실 소통 자체를 제가 재밌어하는 것 같기도 합니다. 그래서 늦게 시작하신 분들에게 한 가지 조언을 드리자면, 사이드 프로젝트를 많이 해보셨으면 좋겠어요. 같은 과제를 진행하면서 소통을 하는 것도 의미 있지만, 다른 역할을 맡으면서 소통을 하면서도 아주 재미있고 많이 배울 수 있거든요."
  }
]
