[
  {
    "text": "어떤 이야기를 하면 좀 더 독특하고 재밌을까 생각하다가 준비한 이야기가 있어요. 다들 이 이야기를 들으면 놀라더라고요. 이건 안 써주셔도 돼요.(웃음) 미국회계사 시험을 치려면 미국에 가야 해요. 한국에서 갈 수 있는 가장 가까운 미국은 괌이기 때문에 보통 괌에 가서 시험을 쳐요. 그런데 괌은 휴양지다 보니 가족 단위로 놀러가는 패션이 많은데, 저 혼자 캐리어 안에 책만 가득 담고 가려니 너무 우울하더라고요."
  },
  {
    "text": "아침에 시험이 끝났고, 저녁에 돌아오는 비행기를 타야 했거든요. 한 8시간 정도 여유가 있었어요. 무작정 시내로 나가서 면세점이랑 기념품 가게를 구경하는데 재미가 없었어요. 그래서 종업원에게 뭘 해야 재밌을지 물어봤는데 마침 오늘 그 가게에서 회식을 한다더라고요. 거기에 초대를 받은 거예요. 가게 사람들이랑 바닷가에서 바베큐를 하며 맥주 마시고 즐기고 왔어요. 다행히 비행기는 안 놓쳤습니다. 그 이후 다음 시험을 보러 한 번 더 괌을 갔는데, 그때는 한국에서 선물을 준비해서 가게 분들에게 나눠줬어요. 이 외에도 더 재밌는 이야기가 많아요. 궁금하면 DM 보내주세요.(웃음)"
  },
  {
    "text": "팀플을 좋아하는 스타일이에요. 아이디어를 제안하고 기획하는 일을 좋아해요. 혼자할 때는 책임감이 좀 적은 편이에요. 그런데 사람들과 모여서 무언가에 대해 얘기하고 같이 할 때는 책임감이 많아지기도 하고요. 그래서 대학 다닐 때는 마케팅을 좋아했어요."
  },
  {
    "text": "마케팅을 좋아했지만 어떻게 전문성을 쌓아야 할지 고민이 됐어요. 경영학과 안에는 많은 전공이 있는데, 수학에 자신이 있던 터라 회계 쪽으로 전향했어요. 관련 자격증을 준비하고 회계법인에서 인턴생활을 하면서 취업준비를 하던 중에 La Piscine을 할 수 있다는 연락을 받았어요. 신청했을 때 대기가 굉장히 길어서 기대를 하지 않고 있었거든요. 마침 La Piscine을 참여할 시간도 되어서 맛만 보려고 했는데, 예상과 달리 헤어나오지 못하고 깊게 빠져들고 있습니다.(웃음)"
  },
  {
    "imageDescription": "sub1"
  },
  {
    "text": "저는 경쟁을 진짜 싫어해요. 고등학교 때부터 다 같이 도우면서 공부하는 걸 좋아했어요. 그리고 공부 했으면서 안 했다고 거짓말 하는 애들을 싫어했어요. 저는 밤 새서 공부했다고 자랑하는 스타일이거든요. (웃음) 그래서 같이 공부할 수 있는 42서울이 너무 좋았어요. 코딩에 대해 정말 아무것도 모르고 들어왔거든요. 첫날에 깃 푸시도 할 줄 몰라서 하루 종일 공부한 게 다 날아가는 줄 알고 운 적도 있어요. 앞으로 어떻게 해야 하나 막막했는데, 여기서는 주변의 누구한테나 물어볼 수 있잖아요. 모두가 선생님이 되어줄 수 있는 게 되게 좋아요."
  },
  {
    "text": "42해커톤에서 깃 브랜치 피신을 제작했어요. 프로젝트 팀원들이랑 협업을 해보니까 어느 시점에 어떤 작업을 했고, 무엇이 맞고 틀린 작업인지 알기 위해선 깃 브랜치를 꼭 써야겠더라고요. 근데 브랜치를 직접 해보려고 하니까 너무 어려워서 며칠 동안 깃만 판 적이 있어요. 마침 이번 해커톤 주제가 피신 제작이었잖아요. 주위에 물어보니까 브랜치에 대해 잘 모르는 분들도 많고, 알고 싶어하는 분들도 많더라고요. 그런 분들에게 도움이 되기 위해 제작해봤습니다. 기회가 된다면 배포도 하고 싶어요."
  },
  {
    "text": "팔만코딩경은 개발에 대한 모든 지식들을 나눌 수 있는 곳이에요. 카뎃이 아니더라도 개발에 대한 정보를 얻고 싶다면 누구나 글을 읽을 수 있어요. 팔만코딩경에 기여하는 분들은 한 달에 1~2개 이상 글을 꾸준히 작성하시고 있어요. 점점 글이 쌓이다 보니 방문자 수도 늘고 있죠. 요새는 월 2천명 정도 되는 거 같아요."
  },
  {
    "text": "팔만코딩경에 기여하며 정보를 정리해서 제 것으로 만들 수 있었어요. 무언가에 대해 알고 있다고 생각했는데, 사실은 제대로 알지 못하던 것이 많더라고요. 팔만코딩경에서는 검색 한번 해보고 넘어갔던 정보를 글로 정리하고 그 글에 대한 피드백을 받아요. 이 과정을 통해, 정리한 정보를 자신의 지식으로  만들 수 있어서 좋아요."
  }
]
