[
  {
    "text": "원래 만드는 걸 좋아했어요. 요리나 라디오 키트 같은 것들이요. 집에서는 이런 것들을 잘 안 사주잖아요. 그리고 미적 감각이 좀 부족했어요. 재료를 구해서 무언가 만들어도 결과물이 안 예쁜 거예요. 그런데 코딩은 컴퓨터만 있으면 할 수 있었죠. 디자인도 다른 사람의 예쁜 것들을 가져다 쓸 수 있어서 그게 좋았던 것 같아요. (웃음)"
  },
  {
    "text": "저는 운이 좋았다고 생각해요. 제가 대학을 다닐 때 딱 아이폰3GS가 출시되고 모바일 개발 환경이 갖추어 졌어요. 그래서 이것저것 할 수 있었던 것 같아요. 그때는 앱을 그냥 혼자 만들어서 내는 게 가능했거든요. 그런데 지금은 그게 쉽지 않잖아요. 요즘 새롭게 유행하는 개발 분야에서 무언가를 하기 위해선 추가적인 장비나 일정 수준의 실력이 필요해진 것 같아요."
  },
  {
    "text": "단, '지금은 쉽지 않다'라는 건 상대적인 것 같아요. 2009년부터 2013년까지, 약 4년 정도는 진짜 좋은 시기였어요. '무언가를 만들어낼 수 있다'는 것만으로도 수익을 낼 수 있었으니까요. 그렇다고 '그 이전에는 코딩으로 먹고살기 힘들었냐' 하면 그건 또 아니거든요. 지금은 예전과는 달리 엄청난 수요가 생기고 있고, 시장은 더 많은 개발자들을 필요로 하니까요. 과거와 또 다른 차이가 있다면 코딩하는 환경이겠네요. 이전에는 개발 툴이 구질구질했는데 지금은 좋아졌으니까요.(웃음) 결과적으로 현재의 시장은 분명 충분히 좋은 시기에 있고, 그러니 도전하시면 된다고 생각합니다."
  },
  {
    "text": "42서울 멘토로 참여하게 된 첫째 이유는, 그동안 채용 과정을 보면서 여러 생각이 들었기 때문입니다. 이제는 취업을 위해 공부를 하는 시대가 되었습니다. 그러다보니 취준생분들이 공부 자체는 열심히 하시는데, 그 방향이 도리어 회사가 원하는 인재상과는 다르다는 걸 느꼈어요. 개인과 회사 사이의 채용에 대한 괴리감이 양쪽에 비효율을 낳는다고 생각했어요. 무언가 돕고 싶었죠. 이야기가 참 거창한 것 같네요. (웃음)"
  },
  {
    "text": "이런 이유 말고도 그냥 잘하는 사람들, 열심히 하는 사람들이랑 코딩에 대해서 이야기하고 싶기도 하고요. 다른 사람들이 어떤 프로젝트를 하는지 궁금합니다. 회사 동료들과는 비슷한 일만 하잖아요. 당연하게도 신선함이 부족하죠. (웃음)"
  },
  {
    "imageDescription": "sub1"
  },
  {
    "text": "새로운 것을 배우는 데 거부감이 조금 적은 편이에요. 일부러 새로운 것을 찾아서 하진 않아요. 하지만 만났을 때 굳이 피하지도 않습니다. 병원에서 의사가 최신 진료 기구도 안 들여놓고 옛날 방식만 고집한다면 환자 입장에서 신뢰를 할 수 있을까요. 누군가는 연륜 자체에서 나오는 신뢰도 있을거에요. 하지만 시간이 흐르다 보면 점점 그것만으로는 극복되지 않는 것이 생깁니다. 개발자들에게 새로운 것을 배운다는 것도 이것과 유사해요. 새로운 것을 피하지 않고 받아들이는 것이 성장하는 길이라고 생각합니다"
  },
  {
    "text": "이 때, 공부만 하고 안 써보는 것은 지양합니다. 이렇게 하면 공부를 할 땐 다 아는 것 같은데, 끝나고 나면 기억이 안 나잖아요. 컴퓨터 언어나 개발용 툴 등 무엇이든 내가 배운 걸 이용해 작은 것이라도 당면한 과제에 도전하는게 더 낫다고 생각합니다. 물론, 아무 것도 모르고 개발을 하면 엉망진창일 수 있습니다. 다 틀릴 수도 있고요. 하지만 만들어낸 프로그램의 기능 중 하나라도 돌아가게 해놓고 이게 어떤 것인지를 생각해봅니다. 이런 방식으로 개발하는 주기를 짧게 할수록 점점 배우게 됩니다."
  },
  {
    "text": "프로젝트를 시작할 때 동기부여가 가장 중요하다고 생각해요. ‘무언가 만들고 싶다고 생각하면 실제로 만드는 것, 거기서부터 학습이 시작되죠. ‘공부’를 목적으로 무언가 만들지는 않았어요. 하고 싶은 걸 정하면 프로젝트 첫 단계를 되도록 빠르게 진행하려고 해요. 가급적 첫 단계를 3일 안에 끝나게 계획합니다. 첫 단계 이후에는 유저들의 피드백을 받으면 다시금 동기부여가 되거든요. 아, 3일만에 끝나게 한다고 해서 3일마다 뭔가 하나씩 만들어 낸다는 뜻은 아닙니다. 가끔 시작할 때 그렇게 한다는 거죠. 피드백을 받으면 해당 프로젝트를 시작하던 순간에 제가 느꼈던 동기가 계속 유지되게 만들어줘요. 오히려 ‘어떻게 더 기능을 추가할까’ 생각이 들기도 하구요. (웃음)"
  },
  {
    "text": "제가 만들었던 것 중에 가장 인상 깊은 건 구름 입력기예요. 쓰는 사람도 별로 없는데 유명한 프로젝트가 되어 버렸어요. 신기했어요. 제가 쓰고 싶어서 만든 건데 다른 유저들의 반응이 나타나고, 새로운 용도를 발굴해서 사용하는 게 신기했죠. 그 중 하나가 MacOS에서 한/영 자판 전환을 빠르게 만들어 준다는 점입니다. 지금은 많이 줄었지만, 옛날 MacOS에서는 한/영 자판 전환에 시간이 걸렸어요. 그런데 구름 입력기를 사용하면 이 딜레이가 줄어든다고 하더라고요. 실제로도 그랬어요. 저는 고려한 적도 없는데 말이죠.(웃음) 그래서 ‘기왕 이리 된 거 더 줄여볼까’ 라는 생각이 들어 전환 속도를 더 빠르게 만들었습니다."
  },
  {
    "text": "이후에 유저들의 요구 개선 사항들을 반영했습니다. 한자 입력 기능을 추가했고, 슬랙에서 이모티콘 쓰는 방법과 유사한 이모티콘 기능도 추가했죠. 이런 경험은 신기했습니다. 왜냐하면 취미로 시작한 프로젝트가 다른 사람들의 관심과 피드백을 받아 더 나은 서비스로 확장되어가는 사실이 당시 저에게는 좋은 경험이었어요. 이 프로그램 덕분에 원하는 회사에 들어갈 기회도 얻었고요."
  }
]
