[
  {
    "text": "제 전공은 철도건설시스템 학과예요. 전문성 있는 학과이고 취업률이 높다는 이유로 선택했었는데 1학년 때는 큰 흥미가 없었어요. 전역 후 복학을 하고 나서 죽어라 공부했지만, 이 길을 계속 가는 게 맞을까 고민했었어요. 그러다 마지막 학기 때 창업 전문 수업을 들으면서 개발에 관한 업무를 접하게 되었고 관심이 생겼어요. 흥미가 있는지 확인하기 위해서 추석과 설 기간 동안 파이썬, html, css 등을 배워보니 재미가 있더라고요(웃음). 그래서 여러 부트 캠프를 찾아보던 중 42서울을 알게 되었어요. 42서울은 다른 부트 캠프와 다르게 기간이 길어요. 취업을 하기 위해서는 결국 비전공자로서 전공자들과도 경쟁해야 할 텐데, 다른 부트캠프에서는 전공자만큼의 CS(Computer Science) 지식을 쌓을 수 없더라고요. 그래서 차근차근 배울 수 있는 42서울이 마음에 들었고, 그때부터 계정을 만들고 로켓을 쏘고 했던 것 같아요."
  },
  {
    "text": "처음 피신에서 탈락한 이후에는 전공 공부를 다시 할지, 코딩을 계속해볼지 고민했어요. 처음부터 전공을 다시 공부할 바에는 개발 공부를 하는 것이 더 도움이 될 거라고 생각해서 코딩 공부를 꾸준히 했어요. 5기 피신을 떨어졌을 때는 재도전의 기회가 없었기 때문에, 어떤 부트 캠프가 더 있을지 찾아봤어요. 부트 캠프를 찾아보면서 ‘내가 모르는 부트 캠프들이 되게 많구나’라는 생각을 했고, 어떤 분야의 공부를 할지 알아보고 있었죠. 그러던 와중에 피신 재도전이 가능하다는 소식을 들었고, 한 번 더 해보고 결정해야겠다고 생각했어요."
  },
  {
    "text": "6기 피신에서 탈락하고, 떨어졌다는 게 믿기지 않았어요. 아무리 생각해도 왜 떨어졌는지 의문이 해소가 안 되고 오히려 더 쌓여갔죠. 그래서 3번째 도전을 하게 되었어요. 그때 당시에는 ‘죽이 되든 밥이 되든 일단 여기는 부수고 간다’ 이런 생각이었던 것 같아요(웃음). 그래서 7기 피신을 위해 더 열심히 준비했죠. 결국, 3번의 도전으로 본과정에 합격해서 카뎃이 되었어요."
  },
  {
    "text": "피신을 3번 도전하면서 많이 성장할 수 있었어요. 5기 때는 독학으로 C언어를 조금 배우고 온 게 다였기 때문에, 누가 물어보면 ‘5기 때의 나는 바보다’라고 말했어요(웃음). 5기 때는 C06까지밖에 과제를 못 했어요. 그런데 6기 때는 C11까지 하면서 이전에 했던 것들을 응용하고 새로운 것을 배우면서 개념이 더 명확해졌어요. 7기 때는 생각하는 방향이 더 확실해졌죠. 피신에서 주어지는 과제는 동일하기 때문에, 여러 번 반복하다 보면 지루하다 느껴질 수밖에 없었어요. 그래서 저는 같은 과제를 하더라도 새로 쳐보면서 하나하나 확인했어요. 예를 들면, 셸 과제에서 명령어들이 점점 길어지는데 이때 명령어 결과를 하나하나 확인해가면서 정확히 어떤 기능을 하는지 테스트해봤어요. 이렇게 과제를 하다 보니까 더 이해가 깊어지는 느낌이더라고요. 무엇을 공부하는 과제인지 알고 나니까 공부 방향을 설정할 수 있었어요. 방향을 설정해놓으면 반복하면서도 새로운 것을 배울 수 있는데, 이게 본인이 성장할 수 있는 원동력이 되는 것 같아요."
  },
  {
    "imageDescription": "sub1"
  },
  {
    "text": "본과정에 와서는 생각했던 대로 기초부터 CS(Computer Science)까지 차근차근 배울 수 있었고, 다양한 부분을 경험해보고 결정해 볼 수 있다는 면에서 계속 도전하길 잘했다는 생각이 들었어요. 동료학습에 대해서도 본과정에 오기 전에 기대가 많았던 것만큼 다른 사람들과 많이 소통할 수 있어서 좋았어요. 이번에 과제를 하면서 스터디를 하나 했는데, 그게 정말 도움이 많이 되었어요. 과제를 하다 보면 새로 배워야 하는 지식이 방대하다 보니까, 이것들을 스스로 찾다 보면 자세하게 알지 못하거나 오래 걸리는데, 여러 명이 파트를 나눠 공부하고 지식을 공유하다 보니 더 자세하게 공부할 수 있었어요. 또, 정리된 자료를 보면서 헷갈리는 것들을 다시 확인할 수 있고, 계속 질문하면서 함께 고민할 수 있다는 게 정말 큰 장점이에요. 많은 사람들이 함께 고민하고 해답을 찾다 보면 결국 올바른 답을 얻게 되는 것 같더라고요. 그래서 공부할 내용이 많은 과제는 스터디를 적극적으로 추천해요."
  },
  {
    "text": "본과정의 장점 중 하나는 슬랙이라고 생각해요. 피신 슬랙보다 더 많은 양의 자료가 있고 다양한 분야의 지식을 알고 있는 사람들 덕분에 지식의 풀이 넓어지는 것 같아요. 피신 슬랙에서는 단순히 모르는 부분에 대해 질문하고 답을 얻는 기능이라면, 본과정의 슬랙은 어떤 한 분야를 굉장히 깊게 공부하는 카뎃들 덕분에 여러 이야기를 들으면서 다양한 분야에 흥미가 생길 수 있어요. 이렇게 다양한 분야를 간접적으로 경험할 수 있다는 점이 저에게는 큰 장점이었어요. 또, 1층에서 탁구를 하거나 게임을 할 수 있는 것도 장점이라 생각해요(웃음)."
  },
  {
    "text": "본과정에 오면 다른 사람들과의 협업이 가장 해보고 싶었어요. 과제뿐만 아니라 최근에 열렸던 ‘에듀톤’처럼 팀 단위의 프로젝트들을 경험해보지 못했는데 이런 것들을 해보고 싶어요. 협업하는 과정에서 소통이 어떤 식으로 이루어지는지, 어떻게 해야 원활하게 잘 진행할 수 있는지를 배우고 싶어요. 그래서 앞으로 개인 과제와 공부도 꾸준히 하면서 여기저기 많은 42 활동을 하는 카뎃이 되고 싶어요. 많은 카뎃들을 만나면서 진심으로 42를 즐길 수 있는 사람이 되려고요."
  }
]
