[
  {
    "question": "무교수 학습의 단점을 감안하더라도 그걸 커버할만한 장점이 있다면 무엇이라고 생각하나요?"
  },
  {
    "text": "그걸 커버할 만한 장점이 여기 있는지 잘 모르겠어요. 대학에선 교수님들한테 배우잖아요. 그 분야에 대해서 깊게 연구한 사람들한테 배우는 건데 여기서도 그 정도의 지식을 스스로 배울 수 있냐라고 물어보면, 그게 되는 사람이 별로 없는 것 같아요. 사람마다 다르다고 말하는게 정확하겠지만 비율 상 많이 적은 것 같아요."
  },
  {
    "text": "그럼에도 다양한 사람들과 함께 오손도손 코딩을 공부할 수 있다는게 큰 장점이라고 생각해요. 전공자 혹은 경력자들의 전공 지식 및 업무와 관련된 내용들을 접할 수 있었고 비전공자의 입장에서, 자세한 내용을 학습하기 힘들었는데 이곳에서 상대적으로 수월하게 학습할 수 있었어요. 그 분들에게 감사의 인사를 드리고 싶네요."
  },
  {
    "question": "그러면 이제 보통 관심을 많이 가지지 않는 로우 레벨 지식들을 계속 공부시키는 거에 이점이 있다고 느끼시나요?"
  },
  {
    "text": "마지막에 트랜센던스 과제를 할 때 JS를 처음 써봤는데 그때 느꼈어요. 처음 마주한 언어로 많은 기능을 가진 웹 서비스를 구현해야하는데, 그 언어에 익숙해지는 과정이 필요 없더라구요. JS를 활용하는 것도 C와 같은 기반을 가지고 있어서 한 눈에 구조를 파악할 수 있었어요. 새로운 언어를 배우기 위한 장벽이 낮아졌다고 느꼈습니다."
  },
  {
    "text": "또 금년도 예비창업패키지라는 정부지원사업을 진행 하면서 하드웨어를 연구하는데,"
  },
  {
    "text": "42에서 배운 지식이 많은 도움이 되었어요. 아두이노로 ADC를 만드는 것에 대해서 학습하고 있는데 굉장히 비슷하다고 느끼고 있습니다."
  },
  {
    "question": "본인이 생각하는 42서울의 장점 / 단점 하나씩 말해주세요."
  },
  {
    "text": "자취의 장점과 단점을 얘기할 때 장점이 뭔가요? 엄마가 없어요. 단점이 뭔가요? 엄마가 없어요. 이렇게 똑같은 게 나오잖아요. 42 서울도 학력, 나이 제한 등이 없는 등 자유도가 높지만, 취창업에 직접적인 도움을 제공하진 않거든요. 그래서 이게 큰 장점이면서 동시에 단점이라고 생각을 해요."
  },
  {
    "text": "다양한 배경을 가진 사람들을 만나고 그들의 생각, 경험들을 공유 받을 수 있어서 도움이 되었고 앞으로도 그럴 거라고 생각을 해요. 커널을 개발하시는 분도 계시고, 그래픽스를 깊게 연구하시는 분도 계셔서 자연스럽게 새로운 분야를 접할 수 있었어요."
  },
  {
    "text": "그런데 그만큼 다양한 케이스가 존재해요. 교수가 없는 만큼 스스로 넓고 깊게 학습을 해야 되는 상황인데 지금껏 공부를 안 해본 경우에는 그냥 공부하는 방법부터 다시 잡아야 돼요. 전혀 별개의 분야를 공부했던 사람들도 힘들어하고요. 이렇게 갈피를 못 잡는 분들은 주변 사람들한테 도움을 받아야 되는데 이 시스템을 충분히 활용하지 못하는 경우가 많은 것 같아요."
  },
  {
    "question": "어찌 보면 취업이라는 현실적인 미래와 동떨어진 교육이라고 느낄 수 있는데 이에 대한 생각 및 계획은 무엇인가요?"
  },
  {
    "text": "42가 원래 취업이 아니라 창업을 권장하는 집단으로 알고 있거든요. 이게 한국에 들어오면서 정부의 지원금을 받게 되고, 실적을 만들어야 하는 상황인데요. 단기적인 성과에 대한 압박을 받는게 독이 되고 있는 것 같아요."
  },
  {
    "text": "빨리 취업을 하길 원하는 분들은 이곳에서 큰 도움을 받기 힘든 것 같아요. 오히려 길게 봐서 2년을 채우고 한 분야를 깊게 파면 취업에도 충분히 메리트가 있어요. 2년씩이나 지원해주는 곳이 흔치 않은데 그 차별점을 잘 살리는 게 개인의 역량에도 이어질 것 같아요."
  },
  {
    "question": "42에 온 이유와 아직 이곳에 남아있는 이유는 무엇인가요?"
  },
  {
    "text": "대학교 동기를 통해 42서울을 알게 됐어요. 개인 사업을 준비하면서 24개월 동안 매달 100만 원이면 최소한의 생활비는 해결할 수 있을 것 같아 알아보게 되었습니다. 학생이었다가 바로 사업을 하기에는 경험도, 돈도 없는 상황이었어서 리스크를 줄이고 싶었거든요. 앞으로도 이곳의 공간과 커뮤니티를 활용하며 다닐 것 같습니다."
  }
]
