[
  {
    "question": "무 교수 학습의 단점을 감안하더라도 그걸 커버할만한 장점이 있다면 무엇이라고 생각하시나요?"
  },
  {
    "text": "능동적으로 학습하지 않으면 아무것도 배우지 못한다는 거죠. 교수가 있는 학습법의 가장 큰 장점은 효율이잖아요. 교수가 없으면 어딘가에서 지식을 찾아 나만의 언어로 바꾸는 과정을 거쳐야하는데 그게 쉽진 않거든요."
  },
  {
    "text": "바꾸어 생각해보면, 누가 가르쳐준다고 해도 그것을 소화하고자 하는 노력이 없다면 그 지식은 무용하다고 생각해요. 그래서 무교수 학습법에는 딱히 단점이 없는 것 같습니다. 본인이 열심히 한다면 말이에요. 어떤 방식이던 결국 자기 몫이 제일 큰 것 같아요"
  },
  {
    "question": "보통 많이 관심을 가지지 않는 저수준 공부를 계속 시키는 것에 이점이 있다고 느끼시나요?"
  },
  {
    "text": "그럴 수 밖에 없죠. 비유적으로 말해자면, 음악을 처음 배울 때는 주법이나 간단한 기교같은 것들을 배우죠. 근데 음악을 제대로 하겠다면 세부적이고 전문적인 부분을 배우게 되죠. 같은 맥락에서, 우리는 개발을 전문으로 할 거니까. 나중에 한다고 해도 어차피 할 거 조금 더 효율적으로 하는 거죠. 애초에 로우 레벨부터 배우는 것이 정도입니다."
  },
  {
    "question": "본인이 생각하는 42서울의 장점 / 단점 하나씩 말해주세요."
  },
  {
    "text": "말할 상대가 있어서 가장 좋은 것 같아요. 그룹을 지어 토론을 하면서 빠르게 학습 목표를 달성하는 경우가 많더라고요. 그런 그룹의 특징이 뭐냐면 자기 것을 계속 설명을 해요. 설명을 하면서 스스로 더 이해를 하더라고요. 그 방법이 늘 적용된다는게 42의 가장 큰 장점이라고 생각합니다."
  },
  {
    "text": "단점은 그 방법을 체화하기까지 오래 걸린다는 거예요. 하지만 이곳에서 시간을 들여서 소통하는 능력과 그를 기반으로 판단력을 기를 수 있다면, 오히려 이 단점이 진정한 개발자가 되는 지름길이 된다고 생각합니다."
  },
  {
    "question": "어찌 보면 취업이라는 현실적인 미래와 동떨어진 교육이라고 느낄 수 있는데 이에 대한 생각 및 계획은 무엇인가요?"
  },
  {
    "text": "저는 그 질문이 좀 웃긴 것 같아요. 언제부터 교육 기관이 취업을 시켜주는 기관이라고 인식이 됐는지 의문이에요. 미래를 위한 토속을 다지는 기관에서 취업 얘기를 한다는 것 자체가 말이 안 된다고 생각을 합니다."
  },
  {
    "text": "그럼에도 불구하고 돈은 벌어야 하니까 취업 이야기를 안 할 수는 없는데요. 전공자인 동기들, 선배들의 이야기를 들어보면 결국엔 CS를 이해하고 활용할 줄 알아야 하는데 현업에서 다시 기반 지식을 다지려고 하면 더 힘들다고 하더라고요. 다른 부트 캠프보다 42서울의 학습방식이 조금 느릴 수 있지만 장기적 관점에선 취업에 유리하다고 생각해요."
  },
  {
    "question": "42에 온 이유와 아직 이곳에 남아있는 이유는 무엇인가요?"
  },
  {
    "text": "전 42서울이 뭔지 잘 몰랐어요. 아버지가 취업 안 하면 아빠 회사에서 일을 하라고 하셨는데 그게 싫어서 지원을 했어요. 사실 제가 원래 공부하던 방식이 42에서와 상당히 유사해요. 학교에선 이해가 잘 안되니까 선생님 말씀도 잘 안 들었어요. 칠판에 증명이나 공식 같은 걸 설명을 하시는데, 그냥 수업을 듣고 앉아만 있는다고 전부 이해가 되는건 아니잖아요."
  },
  {
    "text": "어차피 혼자 다시 공부해야하는데, 왜 내가 교수한테 듣고 있지 싶었어요. 이 교수가 특출난 연구를 해서 세상에 없는 걸 내놨거나 새로운 견해를 주는 게 아니라면, 이미 세상에 존재하는 지식이고 결국 스스로 소화해야 되는데 학교에 그냥 앉아 있는 시간들이 아까웠어요. 그런데 42서울에선 그런 비효율적인 과정이 없는 거예요. '다 같이 자신이 원하는 방향으로 공부를 하고 있네. 서로 대화하며 지식을 정리하며 효율적으로 습득을 하고 있구나. 너무 좋다. 나랑 잘 맞는다. 편하다.'라고 생각했어요."
  },
  {
    "text": "지금까지도 남아있는 이유는 24시간 열려있는 오프라인 공간에 머물면서 계속 기회가 생기는 거예요. '이거 해볼래? 저거 해볼래? 회의실 예약 시스템 만들어볼래? 동아리에서 이런 프로젝트를 하는데 한번 지원해볼래?' 처럼 내가 생각하지 못한 아이디어들을 누군가 제시해줘요. 동료와 함께 도전하고 성장하고 있다는 감각에 이곳에 남아있는 것 같아요."
  },
  {
    "text": "사회에 나가면 사람들과 이것 저것 도전하고 실패하며 배울 기회가 별로 없잖아요. 설령 있다고 해도 작은 실수에도 큰 위험이 따르죠. 그런 면에서 이 곳은 안전하고 기회가 많다고 생각합니다."
  }
]
