[
  {
    "text": "일단 저는 공부를 좋아하는 것 같아요. 근데 낮에는 일을 하다 보니 공부할 시간을 내기 힘들고, 아예 대학이나 대학원에 가서 공부만 하려니 돈이 들잖아요.  그래서 이곳에 왔어요. 여기 오기 전에 병역 특례 때문에 SI 회사에 다니고 있었는데, 매우 불만족스러웠어요. 저는 되게 예쁜 코드를 좋아하는데 형편없는 코드 보면서 저도 시간이 없으니까 그런 코드를 짜야 한다는 점이 마음에 안 들었어요. 거기서는 코드를 예쁘게 깎는 게 아니라 마감 기한에 맞춰 프로젝트를 빨리 치워버려야 해요. 그래서 피신 신청에 성공하고 나서 바로 사직서 내고 피신한 거죠. (웃음)"
  },
  {
    "text": "어렸을 때부터 게임 만드는 거에 관심이 있어서 그래픽 분야를 좋아했어요. 원래 무언가 만드는 것도 좋아하고 게임도 좋아했어요. 게임 만드는 건 특히 더 관심이 있었어요. 할 줄 몰라서 못 하고 있다가 우연히 프로그래밍을 접하게 되었고, 그 이후로 게임 만들려고 프로그래밍을 계속하고 있었는데 현실은 웹 개발하고 있네요."
  },
  {
    "text": "여전히 게임 업계 쪽을 희망하고 있어요. 좋아하니까 돈도 된다면 게임 쪽을 하는 게 좋겠지만 쉽지 않은 것 같아요. 현실적으로 진짜  잘하는 사람이 아니면 업계 대우가 그다지 좋지 않은 것도 있고, 다른 분야가 현실적으로 돈을 더 많이 주기도 하고요. 지금은 구체적으로 언제 게임 쪽으로 이직하겠다, 이런 계획은 아예 없어요. 가능하면 대우가 나빠지지 않는다는 가정하에 게임 쪽 하고 싶기는 해요. 근데 그게 가능할지는 잘 모르겠어요. 다른 분야에 있다가 게임 쪽으로 가면 새롭게 시작해야 하는 거니까 경력 인정을 거의 못 받는 게 현실이고 그걸 메꾸려면 그만큼 잘해야 하는데 그걸 할 수 있을지 모르겠다는 고민이 있는 거죠."
  },
  {
    "text": "중학교 때 개발을 처음 시작했는데 대충 해보니까 잘 되길래 그때부터 코딩이 적성에 맞는다고 느꼈던 것 같아요. 적성에 맞아서 하려는 것뿐이지 뭔가 특별한 코딩의 매력 같은 건 없습니다. 이때 만들었던 것 중에 기억에 남는 게 두 개 정도 있어요. 하나는 PHP로 만든 아무튼 돌아가는 게시판이에요. 지금 생각해 보면 보안 취약점도 많고 진짜 허접해요. 나머지 하나는, 쿠키런이라는 게임 아세요? 쿠키런의 열화판의 열화판 정도 되는 걸 만들었어요."
  },
  {
    "imageDescription": "sub1"
  },
  {
    "text": "작년 2월부터 시작했다고 치면 벌써 본과정에 들어온 지 1년 8개월 정도 됐네요. 시간이 많이 지났군요. 사실 저는 libft, get_next_line, ft_printf 이런 것들은 그냥 C로 안 해봤을 뿐이지 할 수 있는 것들이었어요. 반대로 raytracing은 관심만 있지 실제로 해본 적은 없었어요. 전체적으로 보면 알던 것과 몰랐던 것이 5대 5 정도 될 것 같아요."
  },
  {
    "text": "42는 일단 본인의 수준이 어떻든 뭔가 하려고 하면 여러 가지를 뭔가 분명히 배울 수 있는 좋은 과정이라고 생각해요. 예를 들어, 저는 miniRT(그래픽 과제) 하면서 이상한 짓을 많이 시도했고, 그러면서 배운 게 많아요. 이렇게 각자의 수준에 맞게 할 수 있으니까, 누구든지 42 과정에서 배워갈 점은 있다고 생각해요."
  },
  {
    "imageDescription": "sub2"
  },
  {
    "sub": "miniRT에서 구현한 CSG와 HDR을 적용한 도형",
    "className": "absolute w-full flex justify-center pb-3"
  },
  {
    "text": "되게 재밌어요. 공부할 수 있는 환경이 주어지는 것도 되기에 좋고요. 퇴근하고 나서 공부하는 게 무척 힘들기도 하고 분위기도 안 나서, 회사 다니면서 공부 병행하는 게 쉽지 않은데, 과제 때문에라도 강제로 하게 되니까 좋아요. 저는 원래 과제를 통과만 하는 수준으로는 잘 안 하고 추가로 이것저것 많이 해보는 편이에요. 그렇다 보니 공부도 많이 돼요. 다만 초반에 진짜 클러스터도 거의 안 나오고 집에서 놀았는데, 그랬던 게 좀 많이 아쉬워요. 그렇다 보니 블랙홀이 많이 줄어서 지금 하는 과제는 통과만 할 것 같아요. 그때부터 열심히 했으면 지금쯤 아우터 가서 재밌는 거 하고 있었을 텐데. 더 열심히 했으면 좋을 것 같다는 아쉬움이 있습니다."
  }
]
