[
  {
    "speaker": "inyang(이하 in, 오른쪽)"
  },
  {
    "text": "대학교에서 불어불문학과 문화콘텐츠학을 전공했어요. 예술문화 계통을 좋아해요. 취업 센터에서 상담했을 때, 뮤지컬 분야에서 일을 하고 싶다고 했더니 돈 못 벌 각오를 하라더라고요. 그때 취미와 일을 구분해야겠다고 생각했어요. 이런 생각을 하던 와중에 한 대외활동을 하면서 인간관계에 싫증 났는데, ‘그럼 컴퓨터랑 대화하는 건 어떨까’하는 단순한 생각에 개발을 시작했어요."
  },
  {
    "speaker": "soooh(이하 soo, 왼쪽)"
  },
  {
    "text": "42서울에 오기 이전 인테리어 디자이너로 잠깐 일한 적이 있어요. 들어온 의뢰를 바탕으로 건축 도면을 만들어서 시공하는 것만이 제가 할 일이라고 생각했는데, 현실은 다르더라고요. 도면을 그리기 이전에 영업하는 것부터가 일이었어요. 영업은 적성에 안 맞았어요. 선배들은 한 두 달 지나 고객이 생기면 괜찮아질 거라고 했지만 한 달을 못 참고 나왔어요. 이런저런 고민과 시도를 하다가 중학생 때 HTML을 재미있게 만졌던 게 생각이 나 코딩의 길로 들어섰어요."
  },
  {
    "imageDescription": "sub1"
  },
  {
    "speaker": "soo"
  },
  {
    "text": "이전에 했던 일에 비유하자면 42서울에서의 시간은 기반을 다지고 기둥을 세우는 과정이에요. 단단하게 기초를 닦는 거죠. 여기에 추가로 다른 언어를 익히고 해커톤과 같은 경험을 쌓으며, 벽을 만들어서 예쁜 집을 지어야죠."
  },
  {
    "speaker": "in"
  },
  {
    "text": "42서울의 교육과정은 자유롭게 풀어주면서 긴장감을 줘요. ‘오든 말든 알아서 하고, 책임도 네가 져' 이런 식이죠. ‘어른의 삶은 이런 거구나’ 싶어요. 차라리 학교에 다니는 게 편했겠다고 생각할 때도 있어요(하하). 학교는 일단 등교하면 가서 자더라도 ‘오늘 하루 할 일 다 했다' 이런 생각이 들었는데 말이죠. 이럴 땐 ‘내가 고등학교 체질이었구나’ 싶죠."
  },
  {
    "speaker": "soo"
  },
  {
    "text": "비슷한 생각이에요. 자유를 갈망해오긴 했는데, 막상 동아리 활동은 물론 시험 스케줄까지 모든 걸 직접 관리해야 하니까 ‘갑자기 이렇게 산다고?’ 싶어요. ‘성인이다'와 ‘어른스럽다'라는 말이 다르잖아요. 성인은 누구나 다 할 수 있는데, 어른은 열심히 살고 책임을 져야할 것 같아요. 42서울에서의 삶은 ‘어른스럽다'에 가까운 것 같아요."
  },
  {
    "speaker": "in"
  },
  {
    "text": "요즘은 ‘개발이 내 적성에 맞나’ 고민하는 시기예요. 코딩할 땐 줄곧 주변 사람들에게 도움만 받는 것 같아서요. 본 전공인 문화예술 분야로 돌아갈까도 싶어요. 다른 한편으론 처음이라서 어려운 거라고 생각하기도 해요. 언어도 배우기 시작할 때 단어, 문법 익힐 때가 제일 어렵잖아요. 따지고 보면 프로그래밍 언어도 언어니까 막 시작한 지금 이 시기가 어려운 거겠죠."
  },
  {
    "speaker": "soo"
  },
  {
    "text": "과제를 해낼 때는 기분이 좋지만, 그 이전에 평가받는 건 무서워요. 정직하게 과제를 했지만 치팅으로 보일까 봐요. 이전에는 디펜스에 대한 부담감 때문에 이미 시작한 평가를 중단한 적도 있어요. 평가자에겐 더 공부하고 자신만만하게 평가받고 싶다고 했죠. 지금은 제가 짠 코드를 한글로 번역하는 작업을 하고 있어요. 언제든 어느 부분이든 바로 설명할 수 있게요. 완벽하게 준비하면 자신감이 넘쳐서 ‘이런 부분은 왜 안 물어보세요'라고 되묻기도 해요."
  },
  {
    "speaker": "in"
  },
  {
    "text": "코딩을 하다보면 한편으론 코딩이 영어처럼 필수가 될까봐 걱정돼요. 제가 졸업한 대학도 최근에 기초 교양으로 코딩과목이 생겼더라고요. 세상은 빨리 변하는데 그 변화에 느리게 적응하는 사람을 위한 대비책은 없는 것 같아요. 저희 엄마만 하더라도 스마트폰 어플의 설정 버튼 하나를 제대로 찾기 어려워해요. 우리 세대는 설정이라 쓰여있지 않아도 톱니바퀴 모양을 보면 ‘설정 버튼'인 것을 알잖아요. 이런저런 버튼을 누르다 보면 각 버튼이 어떤 역할을 하는지도 깨닫고요. 그런데 엄마는 스마트폰 사용법 강의를 보고 있더라고요. 얼마 전엔 어플 알림 꺼드리다가 새벽에 울컥했네요."
  }
]
